# -*- org-export-babel-evaluate: nil -*-
#+TAGS: item, tnfsh
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/muse.css" />

#+TITLE: 2020a Items
A:361:1:1,B:353:1:2,C:360:1:3,D:357:1:4,E:356:1:5

* 可憐哪

#+BEGIN_SRC markdown
# 「**可憐哪**」小辭典：高雄市長韓國瑜參加總統大選辯論會，《中央社》總編輯提問總統候選人，面對中國大陸對台灣分化、統戰以及滲透，如何建立良好的兩岸關係與維護主權？韓國瑜狂言嗆回：「親愛的《中央社》總編輯，你自己的問題都已經把台灣狹窄化，可憐哪～」
# 知名社交網站 twitbook 眼見人氣王名言錄又多一金句，很快的就將此金句套用在網路平台中，在「讚」、「倒讚」之外又加入「可憐哪」tag功能，該tag的規則如下：
  - 所有tag的發佈由poor value來決定
  - 如果某人的發文持續無人按讚，每經過1小時poor value自動+1
  - 當無人按讚時數超過24小時，每經1小時poor value自動+2
  - 當無人按讚時數超過3*24小時，每經1小時poor value自動+3
  - 當無人按讚時數超過7*24小時，每經1小時poor value自動+5
  而該PO文的tag種類則依poo value而有所差異：
  - poor value未超過24: tag顯示 Poor~~
  - poor value未超過60: tag顯示 Poor You!
  - poor value未超過100: tag顯示 Pathetic!!
  - poor value未超過200: tag顯示 Ko lan na~~~
  - poor value超過500: tag顯示 Nonsense post!!!
#+END_SRC
#+begin_src cpp -r -n :results output :exports both
#include <iostream>
using namespace std;
int main() {
    int n;
    cin >> n;
    int pv = 0;
    if (n <= 24) {
        pv = n;
    } else if (n <= 3*24) {
        pv = 24 + (n-24)*2;
    } else if (n <= 7*24) {
        pv = 24 + 2*24*2 + (n-3*24)*3;
    } else {
        pv = 24 + 2*24*2 + 4*24*3 + (n-7*24)*5;
    }
    if (pv <= 24) {
        cout << "Poor~~\n";
    } else if (pv <= 60) {
        cout << "Poor You!\n";
    } else if (pv <= 100) {
        cout << "Pathetic!!\n";
    } else if (pv <= 200) {
        cout << "Ko lan na~~~\n";
    } else {
        cout << "Nonsense post!!!!\n";
    }
}
#+end_src

#+RESULTS:
: 4068
: Nonsense post!!!!

** 管你三七二十一 :Easy:for:if:sum:
輸入一個整數 n
求出從 1 ~ n 所有可以被 3 整除及又可以被 7 整除所有 的數字的總和的程式。
#+begin_src python -r -n :results output :exports both
n = 333
sum = 0
for i in range(n+1):
    if i % 3 == 0 and i % 7 == 0:
        sum = sum + i
print(sum)
#+end_src

#+RESULTS:
: 2520

** 天外奇雞 :Easy:for:if:sum:
輸入一個整數 n
計算從 1 到 n 的整數中，所有 奇數 的相乘積並印出。
#+begin_src python -r -n :results output :exports both
n = 11
p = 1
for i in range(1, n+1, 2):
    p = p * i
print(p)
#+end_src

#+RESULTS:
: 10395

** nn多項式 :Easy:for:if:sum:
輸入一個整數 n
求出多項式(1+2)+(2+4)+(3+6)+...+( n+2*n )的和。
#+begin_src python -r -n :results output :exports both
n = 15
sum = 0
for i in range(n+1):
    sum = sum + i + 2*i
print(sum)
#+end_src

#+RESULTS:
: 360

** 買房好難 :Medium:for:if:sum:
輸入一個整數 n
某人在銀行存入$15000，年利率是 4%，如果每年的利息都繼續存入銀行， 請計算在 n 年後，本金加利息一共有多少錢。你可以使用下列公式來計算: 第 n 年底存款總額 = 本金*(1+年利率)^n。
基於現行貨幣制度，只計算到個位數，小數點一律四捨五入。
#+begin_src python -r -n :results output :exports both
n = 50
b = 15000
p = 0.04
t = 1
for i in range(n):
    t = t * ( 1 + p )
print(int(round(b*t, 0)))
#+end_src

#+RESULTS:
: 106600

** 蝸牛老師的點名單 :Medium:string:
繼第一堂課之後同學們因為太無聊了，開始在他們的名字之間空格改成各種不同的字串，例如" and "(不含引號)，假設有兩位同學名字分別是"apple"及"banana"則他們會把點名單寫成"apple and banana"(不含引號)，蝸牛老師很頭痛，希望你幫他寫一個程式把大家的名字分成一行一行的。
#+begin_src python -r -n :results output :exports both
linkStr = 'and'
inputStr = 'appleandbanana'
for item in inputStr.replace(linkStr,' ').split():
    print(item)
#+end_src

#+RESULTS:
: apple
: banana

** nn乘法表 :for-for: :for:Medium:
輸入1，輸出
1*1=1
輸入3，輸出
1*1=1
2*1=2 2*2=4
3*1=3 3*2=6 3*3=9
輸入n，輸出結果(每個式子後都有一個空白)
#+begin_src python -r -n :results output :exports both
n = 5
for i in range(1, n):
    for j in range(1, i+1):
        print("%d*%d=%d" %(i, j, i*j), end=' ')
    print()
#+end_src

#+RESULTS:
: 1*1=1
: 2*1=2 2*2=4
: 3*1=3 3*2=6 3*3=9
: 4*1=4 4*2=8 4*3=12 4*4=16


** 數列質幾何？ :prime:Easy:
輸入m, n，輸出介於m至n(包含m,n)的連續整數中共有多少個質數？
#+begin_src python -r -n :results output :exports both
import math
m = 101
n = 200

def isPrime(i):
    for p in range(2, int(math.sqrt(i))+1):
        if i % p == 0:
            return False
    else:
        return True

countP = 0
for i in range(m, n+1):
    if isPrime(i):
        countP += 1

print(countP)

#+end_src

#+RESULTS:
: False
: 21

** Reduce number :Hard:prime:while:
質因數分解
#+begin_src python -r -n :results output :exports both
n = 1026
i = 2
sList = []
while n != 1:
    while i <= n:
        if n % i == 0:
            sList.append(i)
            n = n // i
            break
        else:
            i += 1
print("*".join(map(str,sList)))
#+end_src

#+RESULTS:
: 2*3*3*3*19

** String caculator :Medium:string:for:if:
輸入一行字符，分別統計出其中英文字母、空格、數字和其它字符的個數。
#+begin_src python -r -n :results output :exports both
str = '123runoobc  kdf235*(dfl'
letters = 0
space = 0
digit = 0
others = 0
for c in str:
    if c.isalpha():
        letters += 1
    elif c.isspace():
        space += 1
    elif c.isdigit():
        digit += 1
    else:
        others += 1
print('char = %d' %(letters))
print('space = %d' %(space))
print('digit = %d' %(digit))
print('other = %d' %(others))
#+end_src

#+RESULTS:
: char = 13
: space = 2
: digit = 6
: other = 2

** 保安，可以讓人這樣加了又加加了又加的嗎??
求s=a+aa+aaa+aaaa+aa...a的值，其中a是一個數字。例如2+22+222+2222+22222(此時共有5個數相加)，幾個數相加由鍵盤控制。
#+begin_src python -r -n :results output :exports both
n = 4
a = 4
nList = [a]
for i in range(4-1):
    a = a * 10 + nList[0]
    nList.append(a)
print(sum(nList))
#+end_src

#+RESULTS:
: [4, 44, 444, 4444]
: 4936

** 自由落體 :Medium:for:if:
一球從100米高度自由落下，每次落地後反跳回原高度的一半；再落下，求它在第10次落地時，共經過多少米？第10次反彈多高？
#+begin_src python -r -n :results output :exports both
height = 100
times = 10

total = height
height = height / 2
for i in range(times-1):
    total = total + height*2
    height = height / 2

print(total,height)
#+end_src

#+RESULTS:
: 299.609375 0.09765625

** 分數數列 :Easy:for:sum:
有一分數序列：2/1，3/2，5/3，8/5，13/8，21/13...求出這個數列的前20項之和。
#+begin_src python -r -n :results output :exports both
n = 20
s = 2.0
m = 1.0
sum = 0
for i in range(n):
    sum += s/m
    s, m = s+m, s

print(sum)

#+end_src

#+RESULTS:
: 32.66026079864164
#+begin_src cpp -r -n :results output :exports both
#include <iostream>
using namespace std;
int main() {
    long int n = 4;
    long int s = 2;
    long int m = 1;
    for (int i = 0; i < n; i++) {
        cout << s << "/" << m << endl;
        long int tmp = s+m;
        m = s;
        s = tmp;
    }
}
#+end_src

#+RESULTS:
: 2/1
: 3/2
: 5/3
: 8/5

** m!~n!和, 10!+11!+....+20! :Medium:for:
#+begin_src python -r -n :results output :exports both
m = 10
n = 20
t = 1
summ = 0
sumn = 0
for i in range(1, n+1):
    t *= i
    sumn += t
    if i < m:
        summ += t
print(summ)
print(sumn)
print(sumn - summ)
#+end_src

#+RESULTS:
: 409113
: 2561327494111820313
: 2561327494111411200
#+begin_src python -r -n :results output :exports both
m = 10
n = 20
t = 1
sum = 0
for i in range(1, n+1):
    t *= i
    if i >= m:
        sum = sum + t
print(sum)
#+end_src

#+RESULTS:
: 2561327494111411200

*** 範例輸出 ：
6
3
5
#+begin_src python -r -n :results output :exports both
while True:
    try:
        n = int(input().split()[0])
        intList = input().split()
        for i in rang(n):
            checkList = list(map(int, input().split()))
            nStar = checkList[0]
            nEnd = checkList[1]
            print(sum(checkList[nStar:nEnd+1]))
    except EOFError:
        break
#+end_src
#+begin_src python -r -n :results output :exports both
list = [1, 2, 3, 4, 5]
print(sum(list[2:4]))
#+end_src

#+RESULTS:
: 7

* test
#+begin_src cpp -r -n :results output :exports both
#include <stdio.h>
using nab
mespace std;
int main() {
    printf("格式印出:%7.2f\n", 12.34);
    printf("格式印出:%7.2f\n", 123.1);
    printf("格式印出:%7.2f\n", 34.3434);
    printf("格式印出:%-7.2fLALALA", 34.3434);
}
#+end_src

#+RESULTS:
: 格式印出:  12.34
: 格式印出: 123.10
: 格式印出:  34.34
: 格式印出:34.34  LALALA
